Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C123/TM4C1236E6PM.svd
        <register>
          <name>RCC</name>
          <description>Run-Mode Clock Configuration</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCC_MOSCDIS</name>
              <description>Main Oscillator Disable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_OSCSRC</name>
              <description>Oscillator Source</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_MAIN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_INT</name>
                  <description>IOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_INT4</name>
                  <description>IOSC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_30</name>
                  <description>LFIOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC_XTAL</name>
              <description>Crystal Value</description>
              <bitRange>[10:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_4MHZ</name>
                  <description>4 MHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_4_09MHZ</name>
                  <description>4.096 MHz</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_4_91MHZ</name>
                  <description>4.9152 MHz</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_5MHZ</name>
                  <description>5 MHz</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_5_12MHZ</name>
                  <description>5.12 MHz</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_6MHZ</name>
                  <description>6 MHz</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_6_14MHZ</name>
                  <description>6.144 MHz</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_7_37MHZ</name>
                  <description>7.3728 MHz</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_8MHZ</name>
                  <description>8 MHz</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_8_19MHZ</name>
                  <description>8.192 MHz</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_10MHZ</name>
                  <description>10 MHz</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_12MHZ</name>
                  <description>12 MHz</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_12_2MHZ</name>
                  <description>12.288 MHz</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_13_5MHZ</name>
                  <description>13.56 MHz</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_14_3MHZ</name>
                  <description>14.31818 MHz</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_16MHZ</name>
                  <description>16 MHz</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_16_3MHZ</name>
                  <description>16.384 MHz</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_18MHZ</name>
                  <description>18.0 MHz (USB)</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_20MHZ</name>
                  <description>20.0 MHz (USB)</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_24MHZ</name>
                  <description>24.0 MHz (USB)</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_25MHZ</name>
                  <description>25.0 MHz (USB)</description>
                  <value>0x1a</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC_BYPASS</name>
              <description>PLL Bypass</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_PWRDN</name>
              <description>PLL Power Down</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_USESYSDIV</name>
              <description>Enable System Clock Divider</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_SYSDIV</name>
              <description>System Clock Divisor</description>
              <bitRange>[26:23]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_ACG</name>
              <description>Auto Clock Gating</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOHBCTL</name>
          <description>GPIO High-Performance Bus Control</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_GPIOHBCTL_PORTA</name>
              <description>Port A Advanced High-Performance Bus</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_GPIOHBCTL_PORTB</name>
              <description>Port B Advanced High-Performance Bus</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_GPIOHBCTL_PORTC</name>
              <description>Port C Advanced High-Performance Bus</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_GPIOHBCTL_PORTD</name>
              <description>Port D Advanced High-Performance Bus</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_GPIOHBCTL_PORTE</name>
              <description>Port E Advanced High-Performance Bus</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_GPIOHBCTL_PORTF</name>
              <description>Port F Advanced High-Performance Bus</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_GPIOHBCTL_PORTG</name>
              <description>Port G Advanced High-Performance Bus</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC2</name>
          <description>Run-Mode Clock Configuration 2</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCC2_OSCSRC2</name>
              <description>Oscillator Source 2</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_MO</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_IO</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_IO4</name>
                  <description>PIOSC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_30</name>
                  <description>LFIOSC</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC2_BYPASS2</name>
              <description>PLL Bypass 2</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_PWRDN2</name>
              <description>Power-Down PLL 2</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_USBPWRDN</name>
              <description>Power-Down USB PLL</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_SYSDIV2LSB</name>
              <description>Additional LSB for SYSDIV2</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_SYSDIV2</name>
              <description>System Clock Divisor 2</description>
              <bitRange>[28:23]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_DIV400</name>
              <description>Divide PLL as 400 MHz vs. 200 MHz</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_USERCC2</name>
              <description>Use RCC2</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MOSCCTL</name>
          <description>Main Oscillator Control</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_MOSCCTL_CVAL</name>
              <description>Clock Validation for MOSC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_MOSCIM</name>
              <description>MOSC Failure Action</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_NOXTAL</name>
              <description>No Crystal Connected</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGC0</name>
          <description>Run Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGC0_WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC0_ADC0SPD</name>
              <description>ADC0 Sample Speed</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC0SPD_125K</name>
                  <description>125K samples/second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC0SPD_250K</name>
                  <description>250K samples/second</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC0SPD_500K</name>
                  <description>500K samples/second</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC0SPD_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCGC0_ADC1SPD</name>
              <description>ADC1 Sample Speed</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC1SPD_125K</name>
                  <description>125K samples/second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC1SPD_250K</name>
                  <description>250K samples/second</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC1SPD_500K</name>
                  <description>500K samples/second</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC1SPD_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCGC0_ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC0_ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC0_CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC0_WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGC1</name>
          <description>Run Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000104</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGC1_UART0</name>
              <description>UART0 Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_UART1</name>
              <description>UART1 Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_UART2</name>
              <description>UART2 Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_SSI1</name>
              <description>SSI1 Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_I2C1</name>
              <description>I2C1 Clock Gating Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER2</name>
              <description>Timer 2 Clock Gating Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER3</name>
              <description>Timer 3 Clock Gating Control</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_COMP1</name>
              <description>Analog Comparator 1 Clock Gating</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGC2</name>
          <description>Run Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000108</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGC2_GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOD</name>
              <description>Port D Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOE</name>
              <description>Port E Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOF</name>
              <description>Port F Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOG</name>
              <description>Port G Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_UDMA</name>
              <description>Micro-DMA Clock Gating Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_USB0</name>
              <description>USB0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGC0</name>
          <description>Sleep Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000110</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGC0_WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
